package com.src.practise.ood_design_pattern;
/*
* 设计模式使用者
*       高级开发
*       架构师
*
* 设计模式 结合业务需求或者自己搭建框架
*
* 数量 23种
*
* 设计模式目的
*            可靠性
*            可读性
*            可复用性
*            可扩展性
*            高内聚低耦合
*
*
* 设计模式中都有一些关键单词，知道这些就知道是哪种设计模式了
*
* 配置文件配置错了，通过修改重启服务器不合理
* 分布式配置中心，解决动态获取配置文件信息，
* 使用zk搭建
* 不需要重启服务器，自动更新配置文件
*
*
* springcloud中自带分布式配置中心，节点发生变化，会有事件监听
*
* 学习11个
* 创建型模式，共五种：
*
*         工厂方法模式
*
*         抽象工厂模式
*
*         单例模式
*
*         建造者模式
*
*         原型模式
*
* 结构型模式，共七种：
*
*         适配器模式
*
*         装饰器模式
*
*         代理模式
*
*         外观模式
*
*         桥接模式
*
*         组合模式
*
*         享元模式
*
* 行为型模式，共十一种：
*
*         策略模式
*
*         模板方法模式
*
*         观察者模式
*
*         迭代子模式
*
*         责任链模式
*
*         命令模式
*
*         备忘录模式
*
*         状态模式
*
*         访问者模式
*
*         中介者模式
*
*         解释器模式
*
*
*
*
*
*
*
*
*
* */